In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={"Isim":["Ahmet","Mehmet","Zeynep","Büşra"],
       "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
       "Kalori":[100,200,300,400]}

In [3]:
dataFrame1=pd.DataFrame(dict1,index = [0,1,2,3])

In [4]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3   Büşra  Basketbol     400

In [5]:
dict2 = {"Isim": ["Osman","Levent","Atlas","Özge"],
         "Spor": ["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori":[200,100,50,300]}

In [6]:
dataFrame2=pd.DataFrame(dict2, index=[4,5,6,7])

In [7]:
dict3 = {"Isim": ["Ayşe","Levent","Atlas","Ezgi"],
         "Spor": ["Koşu","Yüzme","Badminton","Tenis"],
          "Kalori":[300,400,500,250]}

In [8]:
dataFrame3= pd.DataFrame(dict3, index=[8,9,10,11])

In [9]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7    Özge  Basketbol     300

In [10]:
dataFrame3

      Isim       Spor  Kalori
8     Ayşe       Koşu     300
9   Levent      Yüzme     400
10   Atlas  Badminton     500
11    Ezgi      Tenis     250

## concatenation

In [11]:
pd.concat([dataFrame1,dataFrame2,dataFrame3], axis=0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3    Büşra  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7     Özge  Basketbol     300
8     Ayşe       Koşu     300
9   Levent      Yüzme     400
10   Atlas  Badminton     500
11    Ezgi      Tenis     250

## merge

In [12]:
mergeDict1={"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
           "Spor": ["Koşu","Yüzme","Koşu","Basketbol"]}

In [13]:
mergeDataFrame1 = pd.DataFrame(mergeDict1)

In [14]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [15]:
mergeDict2={"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
           "Kalori": [100,200,150,250]}

In [16]:
mergeDataFrame2 = pd.DataFrame(mergeDict2)

In [17]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [18]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on= "Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

In [19]:
salaryDict={"Isim":["Atıl","Zeynep","Mehmet","Ahmet"],
           "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
           "Maas":[200,300,400,500]}

In [20]:
salaryDataFrame=pd.DataFrame(salaryDict)

In [21]:
salaryDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [22]:
salaryDataFrame["Departman"].nunique()

3

In [23]:
salaryDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [24]:
def grosstoNet(salary):
    return salary*0.66

In [25]:
salaryDataFrame["Maas"].apply(grosstoNet)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [26]:
salaryDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [27]:
newData = {"Karakter Sınıfı":["South Park","South Park","Sİmpson","Simpson","Simpson"],
          "Karakter Ismi": ["Cartman","Kenny","Homer","Bart","Bart"],
          "Karakter Yas":[9,10,50,20,10]}

In [28]:
characterDF= pd.DataFrame(newData)

In [29]:
characterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Sİmpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [33]:
characterDF.pivot_table(values="Karakter Yas", index=["Karakter Sınıfı", "Karakter Ismi"], aggfunc=np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
South Park      Cartman                   9
                Kenny                    10
Sİmpson         Homer                    50